InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ВидыПоступленияТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыПоступленияТоваров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСклад</Name>
					<Comment>(Общ) Поступление на склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрдеру</Name>
					<Comment>(Упр) Поступление по приходному ордеру</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС14</Name>
					<Comment>(Общ) Ставка НДС 14%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВедениеВзаиморасчетовПоДоговорам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВедениеВзаиморасчетовПоДоговорам</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоДоговоруВЦелом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПоРасчетнымДокументам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЗаказам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСчетам</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бартерный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/КорректировкаСерийИХарактеристикТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>КорректировкаСерийИХарактеристикТоваров</Name>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровУслуг</xr:Item>
				<xr:Item>Document.ПриходныйОрдерНаТовары</xr:Item>
				<xr:Item>Document.Сервис</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
				<xr:Item>InformationRegister.СписанныеТовары</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccumulationRegister.ПартииТоваровНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРознице</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыКПолучениюНаСклады</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыОрганизаций</xr:Item>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВНТТ</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьПартииТоваровПереданныеНалоговыйУчет</xr:Item>
				<xr:Item>AccumulationRegister.УдалитьПартииТоваровНаСкладахНалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВУправленческомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬОтражатьВНалоговомУчете</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийКорректировкаСерийИХарактеристик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Сервис</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияМест</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьЗаказПокупателя</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Качество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Качество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМест</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатурыНовая</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатурыНовая</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Упр) Розничная цена в розничной торговле</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяПозиция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатурныеПозиции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговоеНазначение</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬСтатьяПриростаУбылиЗапасов</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиНалоговыхДеклараций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УДАЛИТЬУчитываетсяКакЗапасНУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПриходныйОрдер</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ry_ОбщиеПроцедурыПривелигированный/Ext/Module.bsl
Функция СоздатьПоступлениеТоваровУслугПоПриемкеАвто(
	ПодразделениеПриемкиАвто,ВхДата,КонтрагентПриемкиАвто,ВалютаПриемкиАвто,Комментарий
	,СтоимостьАвто,Перегон,Разборка,Растаможка,НовоеАвто,Отказ
)  Экспорт

	ПоступлениеТоваров                    			= Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
	ПоступлениеТоваров.ОтражатьВУправленческомУчете = Истина;
	ПоступлениеТоваров.ОтражатьВБухгалтерскомУчете  = Истина;
	ПоступлениеТоваров.ОтражатьВНалоговомУчете      = Истина;
	ПоступлениеТоваров.Организация		  			= ry_ПолучениеДанных.ПолучитьОрганизациюРезервПоПодразделению(ПодразделениеПриемкиАвто);
	ПоступлениеТоваров.Дата			      			= ВхДата;
	ПоступлениеТоваров.Контрагент         			= КонтрагентПриемкиАвто;
	ПоступлениеТоваров.ДоговорКонтрагента 			= ry_ПолучениеДанных.ПолучитьДоговорКонтрагентаПоПодрИОрг(ПоступлениеТоваров.Контрагент,ПодразделениеПриемкиАвто,ПоступлениеТоваров.Организация);
	ПоступлениеТоваров.ОтражатьВУправленческомУчете = Истина;
	ПоступлениеТоваров.Подразделение = ПодразделениеПриемкиАвто;
	ПоступлениеТоваров.Ответственный = ПараметрыСеанса.ТекущийПользователь;
	Если ПоступлениеТоваров.ДоговорКонтрагента      = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда 
		ПоступлениеТоваров.ДоговорКонтрагента = СоздатьДоговорКонтрагента(ПоступлениеТоваров.Организация,ПоступлениеТоваров.Контрагент,ВалютаПриемкиАвто);	
	КонецЕсли;
	
	Если не Отказ Тогда 
		ПоступлениеТоваров.ВалютаДокумента    = ВалютаПриемкиАвто;
		ПоступлениеТоваров.Дата =   ВхДата;
		ПоступлениеТоваров.КурсВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаПриемкиАвто,ВхДата).курс;
		ПоступлениеТоваров.КратностьВзаиморасчетов = 1;
		ПоступлениеТоваров.СкладОрдер         = ry_ПолучениеДанных.ПолучитьСкладГрузовыхАвтомобилей(ПодразделениеПриемкиАвто);
		ПоступлениеТоваров.ВидПоступления     = Перечисления.ВидыПоступленияТоваров.НаСклад;
		ПоступлениеТоваров.Комментарий		  = Комментарий;
		ПоступлениеТоваров.РегистрироватьЦеныПоставщика = Ложь;

		// + 60249 ДДГ  9 июня 2023
		ПоступлениеТоваров.ЭтоПоступлениеАвтомобиля = Истина;

		СтрокаАвтомобиля = ПоступлениеТоваров.Автомобили.Добавить();
		СтрокаАвтомобиля.Автомобиль	= НовоеАвто;
		СтрокаАвтомобиля.Количество	= 1;
		СтрокаАвтомобиля.СтавкаНДС	= Перечисления.СтавкиНДС.БезНДС;;
		СтрокаАвтомобиля.Цена		= СтоимостьАвто + Перегон + Разборка + Растаможка;
		СтрокаАвтомобиля.Сумма		= СтрокаАвтомобиля.Количество * СтрокаАвтомобиля.Цена;
		СтрокаАвтомобиля.Склад		= ПоступлениеТоваров.СкладОрдер;
		// - 60249 ДДГ  9 июня 2023

//		СтрокаТовары = ПоступлениеТоваров.Товары.Добавить();
//		СтрокаТовары.Номенклатура = НовоеАвто.Ссылка;
//		СтрокаТовары.ЕдиницаИзмерения = НовоеАвто.Ссылка.ЕдиницаХраненияОстатков;
//		СтрокаТовары.Количество   = 1;
//		СтрокаТовары.Коэффициент  = 1;
//		СтрокаТовары.СтавкаНДС    = Перечисления.СтавкиНДС.БезНДС;
//		СтрокаТовары.Цена         = СтоимостьАвто + Перегон + Разборка + Растаможка;
//		СтрокаТовары.Сумма        = СтрокаТовары.Количество*СтрокаТовары.Цена;
//		СтрокаТовары.Склад        = ПоступлениеТоваров.СкладОрдер;
		
		//Форма = ПолучитьФорму("Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента",новый Структура("Ключ",ПоступлениеТоваров));
		//форма.открыть();
		//форма.ЗаписатьВФорме();
		//Форма.Закрыть();
		ПоступлениеТоваров.ОтражатьВУправленческомУчете = Истина;
		ПоступлениеТоваров.ОтражатьВБухгалтерскомУчете  = Истина;
		ПоступлениеТоваров.ОтражатьВНалоговомУчете      = Истина;
		ПоступлениеТоваров.РегистрироватьЦеныПоставщика = Ложь;
		ПоступлениеТоваров.РегистрироватьЦеныПоставщика = Ложь;
		ПоступлениеТоваров.Записать();
		Если РольДоступна("ПолныеПрава") Тогда 
			ПоступлениеТоваров.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;
		Возврат  ПоступлениеТоваров.Ссылка;
	КонецЕсли;
КонецФункции

// + S1-137 ДДГ 15 авг 2024
Функция СоздатьПоступлениеТоваровУслугПоПриемкеСделки(
	ПодразделениеПриемки,ВхДата,КонтрагентПриемки,ВалютаПриемки,Комментарий
	,Сумма,СсылкаСделки,Отказ
)  Экспорт

	ПоступлениеТоваров                    			= Документы.ПоступлениеТоваровУслуг.СоздатьДокумент();
	ПоступлениеТоваров.ОтражатьВУправленческомУчете = Истина;
	ПоступлениеТоваров.ОтражатьВБухгалтерскомУчете  = Истина;
	ПоступлениеТоваров.ОтражатьВНалоговомУчете      = Истина;
	ПоступлениеТоваров.Организация		  			= ry_ПолучениеДанных.ПолучитьОрганизациюРезервПоПодразделению(ПодразделениеПриемки);
	ПоступлениеТоваров.Дата			      			= ВхДата;
	ПоступлениеТоваров.Контрагент         			= КонтрагентПриемки;
	ПоступлениеТоваров.ДоговорКонтрагента 			= ry_ПолучениеДанных.ПолучитьДоговорКонтрагентаПоПодрИОрг(ПоступлениеТоваров.Контрагент,ПодразделениеПриемки,ПоступлениеТоваров.Организация);
	ПоступлениеТоваров.ОтражатьВУправленческомУчете = Истина;
	ПоступлениеТоваров.Подразделение = ПодразделениеПриемки;
	ПоступлениеТоваров.Ответственный = ПараметрыСеанса.ТекущийПользователь;

	Если ПоступлениеТоваров.ДоговорКонтрагента      = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда 
		ПоступлениеТоваров.ДоговорКонтрагента = СоздатьДоговорКонтрагента(ПоступлениеТоваров.Организация,ПоступлениеТоваров.Контрагент,ВалютаПриемки);	
	КонецЕсли;
	
	Если не Отказ Тогда 
		ПоступлениеТоваров.ВалютаДокумента    = ВалютаПриемки;
		ПоступлениеТоваров.Дата =   ВхДата;
		ПоступлениеТоваров.КурсВзаиморасчетов = МодульВалютногоУчета.ПолучитьКурсВалюты(ВалютаПриемки,ВхДата).курс;
		ПоступлениеТоваров.КратностьВзаиморасчетов = 1;
//		ПоступлениеТоваров.СкладОрдер         = ry_ПолучениеДанных.ПолучитьСкладГрузовыхАвтомобилей(ПодразделениеПриемки);
		ПоступлениеТоваров.ВидПоступления     = Перечисления.ВидыПоступленияТоваров.НаСклад;
		ПоступлениеТоваров.Комментарий		  = Комментарий;
		ПоступлениеТоваров.РегистрироватьЦеныПоставщика = Ложь;

		ПоступлениеТоваров.ЭтоПоступлениеПоСделке = Истина;

		СтрокаСделки = ПоступлениеТоваров.Сделки.Добавить();
		СтрокаСделки.Сделка		= СсылкаСделки;
		СтрокаСделки.Количество	= 1;
		СтрокаСделки.СтавкаНДС	= Перечисления.СтавкиНДС.БезНДС;;
		СтрокаСделки.Цена		= Сумма;
		СтрокаСделки.Сумма		= Сумма;
		СтрокаСделки.Склад		= ПоступлениеТоваров.СкладОрдер;

		ПоступлениеТоваров.ОтражатьВУправленческомУчете = Истина;
		ПоступлениеТоваров.ОтражатьВБухгалтерскомУчете  = Истина;
		ПоступлениеТоваров.ОтражатьВНалоговомУчете      = Истина;
		ПоступлениеТоваров.РегистрироватьЦеныПоставщика = Ложь;
		ПоступлениеТоваров.РегистрироватьЦеныПоставщика = Ложь;
		ПоступлениеТоваров.Записать();
		Если РольДоступна("ПолныеПрава") Тогда 
			ПоступлениеТоваров.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли;

		Возврат  ПоступлениеТоваров.Ссылка;

	КонецЕсли;
КонецФункции
// - S1-137 ДДГ 15 авг 2024

Функция СоздатьДоговорКонтрагента(Организация,Контрагент,Валюта)
	
	ДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
	ДоговорКонтрагента.Организация = Организация;
	ДоговорКонтрагента.ВалютаВзаиморасчетов = Валюта;
	ДоговорКонтрагента.Владелец = Контрагент;
	ДоговорКонтрагента.ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
	ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
	ДоговорКонтрагента.КонтролироватьСуммуЗадолженности = Истина;
	ДоговорКонтрагента.ДопустимаяСуммаЗадолженности = 0;
	ДоговорКонтрагента.КонтролироватьЧислоДнейЗадолженности = Истина;
	ДоговорКонтрагента.Записать();
	
	Возврат ДоговорКонтрагента.Ссылка;

КонецФункции	

#Область ЗаменаНоменклатуры
// + 51319 ДДГ 25 мая 2022
// обнов ДДГ 20 июня 2022
// обнов PN3-161 ДДГ 26 фев 2024
// обнов PN3-217 ДДГ  5 июнь 2024
// обнов ДДГ 21 авг 2024
Функция ТаблицыНенужныеДляЗаполнения() Экспорт

	СоотвНенужного = Новый Соответствие;

	СоотвНенужного.Вставить("Справочник._УчетныеЗаписиEbay"					, Истина);
	СоотвНенужного.Вставить("Документ.ЗаказПокупателя.ТабличнаяЧасть.Услуги", Истина);
	СоотвНенужного.Вставить("Документ.КорректировкаСерийИХарактеристикТоваров.ТабличнаяЧасть.Товары", Истина);
	СоотвНенужного.Вставить("РегистрСведений.ДопустимыеКомбинации"			, Истина);
	СоотвНенужного.Вставить("РегистрСведений.ЗначенияСвойствОбъектов"		, Истина);
	СоотвНенужного.Вставить("РегистрСведений.ЗначенияСвойствОбъектовWEB"	, Истина);
	СоотвНенужного.Вставить("РегистрСведений.ВозможныеЗначенияСвойствWEB"	, Истина);
	СоотвНенужного.Вставить("РегистрСведений.ОчередьЗаменыНоменклатуры"		, Истина);

	Возврат СоотвНенужного;

КонецФункции

Функция ЗаполнитьТаблицуОбъектовНаСервере() Экспорт

	ТаблицаОбъектов = Новый ТаблицаЗначений;
	КолонкиТО = ТаблицаОбъектов.Колонки;
	КолонкиТО.Добавить("ТипОбъекта");
	КолонкиТО.Добавить("Номенклатура");
	КолонкиТО.Добавить("Характеристика");
	КолонкиТО.Добавить("Статус");

	Для Каждого ОбъектМетаданных Из Метаданные.Документы Цикл
		ЗаполнитьРеквизитыОбъектаМетаданных(ТаблицаОбъектов, ОбъектМетаданных);
		ЗаполнитьТабличныеЧастиОбъектаМетаданных(ТаблицаОбъектов, ОбъектМетаданных);
	КонецЦикла;

	Для Каждого ОбъектМетаданных Из Метаданные.Справочники Цикл
		ЗаполнитьРеквизитыОбъектаМетаданных(ТаблицаОбъектов, ОбъектМетаданных);
		ЗаполнитьТабличныеЧастиОбъектаМетаданных(ТаблицаОбъектов, ОбъектМетаданных);
	КонецЦикла;

	Для Каждого ОбъектМетаданных Из Метаданные.БизнесПроцессы Цикл
		ЗаполнитьРеквизитыОбъектаМетаданных(ТаблицаОбъектов, ОбъектМетаданных);
		ЗаполнитьТабличныеЧастиОбъектаМетаданных(ТаблицаОбъектов, ОбъектМетаданных);
	КонецЦикла;

	Для Каждого ОбъектМетаданных Из Метаданные.Задачи Цикл
		ЗаполнитьРеквизитыОбъектаМетаданных(ТаблицаОбъектов, ОбъектМетаданных);
		ЗаполнитьТабличныеЧастиОбъектаМетаданных(ТаблицаОбъектов, ОбъектМетаданных);
	КонецЦикла;

	Для Каждого ОбъектМетаданных Из Метаданные.РегистрыСведений Цикл
		Если ОбъектМетаданных.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьРеквизитыРегистраСведений(ТаблицаОбъектов, ОбъектМетаданных);
	КонецЦикла;

	МассивУдаляемыхСтрок = Новый Массив;

	СоотвНенужного = ТаблицыНенужныеДляЗаполнения();

	Для Каждого СтрокаТО Из ТаблицаОбъектов Цикл
		Если СоотвНенужного.Получить(СтрокаТО.ТипОбъекта) = Истина Тогда
			МассивУдаляемыхСтрок.Добавить(СтрокаТО);
		КонецЕсли;
	КонецЦикла;

	Для Каждого СтрокаУдаления Из МассивУдаляемыхСтрок Цикл
		ТаблицаОбъектов.Удалить(СтрокаУдаления);
	КонецЦикла;

	Возврат ТаблицаОбъектов;

КонецФункции

Процедура ЗаполнитьРеквизитыОбъектаМетаданных(ТаблицаОбъектов, ОбъектМетаданных)

	ТипНом = Тип("СправочникСсылка.Номенклатура");
	ТипХар = Тип("СправочникСсылка.ХарактеристикиНоменклатуры");

	ТипОбъекта = ОбъектМетаданных.ПолноеИмя();
	ИмяРеквНом = "";
	ИмяРеквХар = "";
	Статус = "";

	МассивНом = Новый Массив;
	МассивХар = Новый Массив;

	Для Каждого РеквизитОбъекта Из ОбъектМетаданных.Реквизиты Цикл

		Если РеквизитОбъекта.Тип.СодержитТип(ТипХар) Тогда

			ИмяРекв = РеквизитОбъекта.Имя;

			Если ИмяРеквХар = "" Тогда
				ИмяРеквХар = ИмяРекв;
			Иначе
				Статус = Статус + "Повтор харки: " + ИмяРекв + ". "
			КонецЕсли;

			МассивХар.Добавить(ИмяРекв);

		ИначеЕсли РеквизитОбъекта.Тип.СодержитТип(ТипНом) Тогда

			ИмяРекв = РеквизитОбъекта.Имя;

			Если ИмяРеквНом = "" Тогда
				ИмяРеквНом = ИмяРекв;
			Иначе
				Статус = Статус + "Повтор ном: " + ИмяРекв + ". "
			КонецЕсли;

			МассивНом.Добавить(ИмяРекв);

		КонецЕсли;

	КонецЦикла;

	Если ИмяРеквХар = "" ИЛИ ИмяРеквНом = "" Тогда
		Возврат;
	КонецЕсли;

	Если МассивНом.Количество() > 1
	   И МассивХар.Количество() > 1
	   И МассивНом.Количество() = МассивХар.Количество()
	Тогда

		СоотвХарНом = Новый Соответствие;

		ИДХ = 0;
		Лимит = МассивНом.Количество();

		Пока ИДХ < Лимит Цикл

			СтрНом = МассивНом[ИДХ];

			ПодСтрПоиска = Лев(СтрНом, 7);

			Для Каждого СтрХарки Из МассивХар Цикл
				Если Найти(СтрХарки, ПодСтрПоиска) Тогда
					СоотвХарНом.Вставить(СтрНом, СтрХарки);
					МассивХар.Удалить(МассивХар.Найти(СтрХарки));
					МассивНом.Удалить(ИДХ);
					ИДХ = ИДХ - 1;
					Лимит = Лимит - 1;
				КонецЕсли;
			КонецЦикла;

			ИДХ = ИДХ + 1;

		КонецЦикла;

		Если МассивНом.Количество() < 2 И МассивХар.Количество() < 2 Тогда
			Для ИДХ=0 По МассивНом.ВГраница() Цикл
				СоотвХарНом.Вставить(МассивНом[ИДХ], МассивХар[ИДХ]);
			КонецЦикла;
		Иначе
			СтрокаТО = ТаблицаОбъектов.Добавить();
			СтрокаТО.ТипОбъекта = ТипОбъекта;
			СтрокаТО.Номенклатура	= ?(МассивНом.Количество() > 1, МассивНом, ИмяРеквНом);
			СтрокаТО.Характеристика	= ?(МассивХар.Количество() > 1, МассивХар, ИмяРеквХар);
			СтрокаТО.Статус = Статус;
		КонецЕсли;

		Для Каждого КлючЗнач Из СоотвХарНом Цикл
			СтрокаТО = ТаблицаОбъектов.Добавить();
			СтрокаТО.ТипОбъекта = ТипОбъекта;
			СтрокаТО.Номенклатура = КлючЗнач.Ключ;
			СтрокаТО.Характеристика = КлючЗнач.Значение;
			СтрокаТО.Статус = Статус;
		КонецЦикла;

		Возврат;

	КонецЕсли;

	СтрокаТО = ТаблицаОбъектов.Добавить();
	СтрокаТО.ТипОбъекта = ТипОбъекта;
	СтрокаТО.Номенклатура	= ?(МассивНом.Количество() > 1, МассивНом, ИмяРеквНом);
	СтрокаТО.Характеристика	= ?(МассивХар.Количество() > 1, МассивХар, ИмяРеквХар);
	СтрокаТО.Статус = Статус;

КонецПроцедуры

Процедура ЗаполнитьТабличныеЧастиОбъектаМетаданных(ТаблицаОбъектов, ОбъектМетаданных)

	ТипНом = Тип("СправочникСсылка.Номенклатура");
	ТипХар = Тип("СправочникСсылка.ХарактеристикиНоменклатуры");

	Для Каждого ОбъектТЧ Из ОбъектМетаданных.ТабличныеЧасти Цикл
		ЗаполнитьРеквизитыОбъектаМетаданных(ТаблицаОбъектов, ОбъектТЧ);
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьРеквизитыРегистраСведений(ТаблицаОбъектов, ОбъектМетаданных)

	ТипНом = Тип("СправочникСсылка.Номенклатура");
	ТипХар = Тип("СправочникСсылка.ХарактеристикиНоменклатуры");

	ТипОбъекта = ОбъектМетаданных.ПолноеИмя();
	ИмяРеквНом = "";
	ИмяРеквХар = "";
	Статус = "";
	Заполнено = Ложь;

	МассивНом = Новый Массив;
	МассивХар = Новый Массив;

	Для Каждого РеквизитОбъекта Из ОбъектМетаданных.Измерения Цикл

		Если РеквизитОбъекта.Тип.СодержитТип(ТипХар) Тогда

			ИмяРекв = РеквизитОбъекта.Имя;

			Если ИмяРеквХар = "" Тогда
				ИмяРеквХар = ИмяРекв;
			Иначе
				Статус = Статус + "Повтор харки: " + ИмяРекв + ". "
			КонецЕсли;

			МассивХар.Добавить(ИмяРекв);

		ИначеЕсли РеквизитОбъекта.Тип.СодержитТип(ТипНом) Тогда

			ИмяРекв = РеквизитОбъекта.Имя;

			Если ИмяРеквНом = "" Тогда
				ИмяРеквНом = ИмяРекв;
			Иначе
				Статус = Статус + "Повтор ном: " + ИмяРекв + ". "
			КонецЕсли;

			МассивНом.Добавить(ИмяРекв);

		КонецЕсли;

	КонецЦикла;

	Если ИмяРеквХар <> "" И ИмяРеквНом <> "" Тогда
		Статус = "Измерение. " + Статус;
		Заполнено = Истина;
	КонецЕсли;

	//

	Для Каждого РеквизитОбъекта Из ОбъектМетаданных.Ресурсы Цикл

		Если РеквизитОбъекта.Тип.СодержитТип(ТипХар) Тогда

			ИмяРекв = РеквизитОбъекта.Имя;

			Если ИмяРеквХар = "" Тогда
				ИмяРеквХар = ИмяРекв;
			Иначе
				Статус = Статус + "Повтор харки: " + ИмяРекв + ". "
			КонецЕсли;

			МассивХар.Добавить(ИмяРекв);

		ИначеЕсли РеквизитОбъекта.Тип.СодержитТип(ТипНом) Тогда

			ИмяРекв = РеквизитОбъекта.Имя;

			Если ИмяРеквНом = "" Тогда
				ИмяРеквНом = ИмяРекв;
			Иначе
				Статус = Статус + "Повтор ном: " + ИмяРекв + ". "
			КонецЕсли;

			МассивНом.Добавить(ИмяРекв);

		КонецЕсли;

	КонецЦикла;

	Если ИмяРеквХар <> "" И ИмяРеквНом <> "" И НЕ Заполнено Тогда
		Статус = Статус + "Ресурс. ";
		Заполнено = Истина;
	КонецЕсли;

	//

	Для Каждого РеквизитОбъекта Из ОбъектМетаданных.Реквизиты Цикл

		Если РеквизитОбъекта.Тип.СодержитТип(ТипХар) Тогда

			ИмяРекв = РеквизитОбъекта.Имя;

			Если ИмяРеквХар = "" Тогда
				ИмяРеквХар = ИмяРекв;
			Иначе
				Статус = Статус + "Повтор харки: " + ИмяРекв + ". "
			КонецЕсли;

			МассивХар.Добавить(ИмяРекв);

		ИначеЕсли РеквизитОбъекта.Тип.СодержитТип(ТипНом) Тогда

			ИмяРекв = РеквизитОбъекта.Имя;

			Если ИмяРеквНом = "" Тогда
				ИмяРеквНом = ИмяРекв;
			Иначе
				Статус = Статус + "Повтор ном: " + ИмяРекв + ". "
			КонецЕсли;

			МассивНом.Добавить(ИмяРекв);

		КонецЕсли;

	КонецЦикла;

	Если ИмяРеквХар = "" ИЛИ ИмяРеквНом = "" Тогда
		Возврат;
	КонецЕсли;

	Если НЕ Заполнено Тогда
		Статус = Статус + "Реквизит. ";
		Заполнено = Истина;
	КонецЕсли;

	Если МассивНом.Количество() > 1
	   И МассивХар.Количество() > 1
	   И МассивНом.Количество() = МассивХар.Количество()
	Тогда

		СоотвХарНом = Новый Соответствие;

		ИДХ = 0;
		Лимит = МассивНом.Количество();

		Пока ИДХ < Лимит Цикл

			СтрНом = МассивНом[ИДХ];

			ПодСтрПоиска = Лев(СтрНом, 7);

			Для Каждого СтрХарки Из МассивХар Цикл
				Если Найти(СтрХарки, ПодСтрПоиска) Тогда
					СоотвХарНом.Вставить(СтрНом, СтрХарки);
					МассивХар.Удалить(МассивХар.Найти(СтрХарки));
					МассивНом.Удалить(ИДХ);
					ИДХ = ИДХ - 1;
					Лимит = Лимит - 1;
				КонецЕсли;
			КонецЦикла;

			ИДХ = ИДХ + 1;

		КонецЦикла;

		Если МассивНом.Количество() < 2 И МассивХар.Количество() < 2 Тогда
			Для ИДХ=0 По МассивНом.ВГраница() Цикл
				СоотвХарНом.Вставить(МассивНом[ИДХ], МассивХар[ИДХ]);
			КонецЦикла;
		Иначе
			СтрокаТО = ТаблицаОбъектов.Добавить();
			СтрокаТО.ТипОбъекта = ТипОбъекта;
			СтрокаТО.Номенклатура	= ?(МассивНом.Количество() > 1, МассивНом, ИмяРеквНом);
			СтрокаТО.Характеристика	= ?(МассивХар.Количество() > 1, МассивХар, ИмяРеквХар);
			СтрокаТО.Статус = Статус;
		КонецЕсли;

		Для Каждого КлючЗнач Из СоотвХарНом Цикл
			СтрокаТО = ТаблицаОбъектов.Добавить();
			СтрокаТО.ТипОбъекта = ТипОбъекта;
			СтрокаТО.Номенклатура = КлючЗнач.Ключ;
			СтрокаТО.Характеристика = КлючЗнач.Значение;
			СтрокаТО.Статус = Статус;
		КонецЦикла;

		Возврат;

	КонецЕсли;

	Если ТипОбъекта = "РегистрСведений.УслугиТоваров" Тогда
		МассивНом = Новый Массив;
		МассивНом.Добавить("Товар");
	КонецЕсли;

	СтрокаТО = ТаблицаОбъектов.Добавить();
	СтрокаТО.ТипОбъекта = ТипОбъекта;
	СтрокаТО.Номенклатура	= ?(МассивНом.Количество() > 1, МассивНом, ИмяРеквНом);
	СтрокаТО.Характеристика	= ?(МассивХар.Количество() > 1, МассивХар, ИмяРеквХар);
	СтрокаТО.Статус = Статус;

КонецПроцедуры

//////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция СформироватьТекстЗапросаПоискСсылокХарактеристики(ТаблицаОбъектов) Экспорт

	ТекстЗапроса = "";

	ПроверкаДокумент		= "Документ.";
	ПроверкаСправочник		= "Справочник.";
	ПроверкаБизнесПроцесс	= "БизнесПроцесс.";
	ПроверкаЗадача			= "Задача.";
	ПроверкаРегистрСведений	= "РегистрСведений.";

	ДлинаПроверкаДокумент			= СтрДлина(ПроверкаДокумент);
	ДлинаПроверкаСправочник			= СтрДлина(ПроверкаСправочник);
	ДлинаПроверкаБизнесПроцесс		= СтрДлина(ПроверкаБизнесПроцесс);
	ДлинаПроверкаЗадача				= СтрДлина(ПроверкаЗадача);
	ДлинаПроверкаРегистрСведений	= СтрДлина(ПроверкаРегистрСведений);

	СтрокаОбъединить = Символы.ПС + "ОБЪЕДИНИТЬ ВСЕ" + Символы.ПС;

	Для Каждого СтрокаТО Из ТаблицаОбъектов Цикл

		ТипОбъекта = СтрокаТО.ТипОбъекта;

		ТипЭтоРегистр = (Лев(ТипОбъекта, ДлинаПроверкаРегистрСведений) = ПроверкаРегистрСведений);
		ТипЭтоДокумент = (Лев(ТипОбъекта, ДлинаПроверкаДокумент) = ПроверкаДокумент);
		ТипЭтоТЧ = ЭтоТЧ(ТипОбъекта);

		ИмяТаблицы = ?(
			ТипЭтоТЧ, СтрЗаменить(ТипОбъекта, ".ТабличнаяЧасть.", "."), ТипОбъекта
		);

		ИмяОбъекта = ?(
			ТипЭтоРегистр, СтрЗаменить(ТипОбъекта, ПроверкаРегистрСведений, "")
			, ?(
				ТипЭтоТЧ, СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТипОбъекта, ".")[3]
				, СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТипОбъекта, ".")[1]
			)
		);

		СтрокаЗапроса = "
		|ВЫБРАТЬ
		|	""" + ТипОбъекта + """ КАК ТипОбъекта,
		|	""" + ИмяОбъекта + """ КАК ИмяОбъекта,
		|	" + ?(ТипЭтоДокумент
			, ?(ТипЭтоТЧ,			"Ссылка.Дата", "Дата")
			, "ДАТАВРЕМЯ(1,1,1)") + " КАК Дата,
		|	" + ?(ТипЭтоРегистр,	"""" + ТипОбъекта + """", "ПРЕДСТАВЛЕНИЕ(Ссылка)") + " КАК ПредставлениеОбъекта,
		|	ЛОЖЬ КАК ПодчинениеРегистратору,
		|	" + ?(ТипЭтоРегистр,	"ИСТИНА", "ЛОЖЬ") + " КАК ЭтоРегистр,
		|	" + ?(ТипЭтоТЧ,			"ИСТИНА", "ЛОЖЬ") + " КАК ЭтоТЧ,
		|	""" + СтрокаТО.Номенклатура		+ """ КАК ПолеНоменклатура,
		|	""" + СтрокаТО.Характеристика	+ """ КАК ПолеХарактеристика,
		|	" + ?(ТипЭтоРегистр,	"NULL",			"Ссылка") + " КАК Ссылка,
		|	" + ?(ТипЭтоТЧ,			"НомерСтроки",	"NULL") + " КАК НомерСтроки
//		|	" + СтрокаТО.Номенклатура	+ " КАК Номенклатура,
//		|	" + СтрокаТО.Характеристика	+ " КАК Характеристика
		|ИЗ
		|	" + ИмяТаблицы + "
		|ГДЕ " + СтрокаТО.Номенклатура		+ " = &Номенклатура
		|  И " + СтрокаТО.Характеристика	+ " = &Характеристика
		|" + СтрокаОбъединить;

		ТекстЗапроса = ТекстЗапроса + СтрокаЗапроса;

	КонецЦикла;

	СтрокаЗапроса = "
		|ВЫБРАТЬ
		|	""РегистрНакопления.ТоварыВРезервеНаСкладах"" КАК ТипОбъекта,
		|	""ТоварыВРезервеНаСкладах"" КАК ИмяОбъекта,
		|	ТоварыВРезервеНаСкладах.Период КАК Дата,
		|	ПРЕДСТАВЛЕНИЕ(ТоварыВРезервеНаСкладах.Регистратор) КАК ПредставлениеОбъекта,
		|	ИСТИНА КАК ПодчинениеРегистратору,
		|	ЛОЖЬ КАК ЭтоРегистр,
		|	ЛОЖЬ КАК ЭтоТЧ,
		|	""Номенклатура"" КАК ПолеНоменклатура,
		|	""ХарактеристикаНоменклатуры"" КАК ПолеХарактеристика,
		|	ТоварыВРезервеНаСкладах.Регистратор КАК Ссылка,
		|	NULL КАК НомерСтроки
		|ИЗ
		|	РегистрНакопления.ТоварыВРезервеНаСкладах КАК ТоварыВРезервеНаСкладах
		|ГДЕ
		|	ТоварыВРезервеНаСкладах.Регистратор ССЫЛКА Документ.ЗакрытиеЗаказовПокупателей
		|	И ТоварыВРезервеНаСкладах.Номенклатура = &Номенклатура
		|	И ТоварыВРезервеНаСкладах.ХарактеристикаНоменклатуры = &Характеристика
	|";

	ТекстЗапроса = ТекстЗапроса + СтрокаЗапроса;

//	СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекстЗапроса, СтрДлина(СтрокаОбъединить));

	Возврат ТекстЗапроса;

КонецФункции

Функция ЭтоТЧ(ТипОбъекта) Экспорт

	МассивПодстрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ТипОбъекта, ".");

	Если МассивПодстрок.Количество() < 4 Тогда
		Возврат Ложь;
	КонецЕсли;

	ЭлементМассива = МассивПодстрок[2];

	Возврат ЭлементМассива = "ТабличнаяЧасть";

КонецФункции

Функция ПолучитьОбъектыСсылокЗамены(ТекстЗапроса, Номенклатура, Характеристика) Экспорт

	Запрос = Новый Запрос(ТекстЗапроса);

	Запрос.УстановитьПараметр("Номенклатура",	Номенклатура);
	Запрос.УстановитьПараметр("Характеристика",	Характеристика);

	РезультатЗапроса	= Запрос.Выполнить();
	ТаблицаРезультата	= РезультатЗапроса.Выгрузить();

	ТаблицаРезультата.Сортировать("Дата");

	Возврат ТаблицаРезультата;

КонецФункции

//////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция ПолучитьТаблицуДляЗаменыНоменклатурыХарактеристики(СтараяНоменклатура, ИскомаяХарактеристика) Экспорт

	ТабОбж = ЗаполнитьТаблицуОбъектовНаСервере();
	ТекстЗапроса = СформироватьТекстЗапросаПоискСсылокХарактеристики(ТабОбж);
	ТаблицаРезультата = ПолучитьОбъектыСсылокЗамены(ТекстЗапроса, СтараяНоменклатура, ИскомаяХарактеристика);

	Возврат ТаблицаРезультата;

КонецФункции

Процедура ВыполнитьЗаменуНоменклатурыХарактеристики(
		ТаблицаЗамен, СтараяНоменклатура, ИскомаяХарактеристика, НоменклатураЗамены, УникИдФормы = Неопределено
) Экспорт

	УстановитьПривилегированныйРежим(Истина);
//	НачатьТранзакцию();

	Для Каждого СтрокаТЗ Из ТаблицаЗамен Цикл

		ПолеНоменклатура	= СтрокаТЗ.ПолеНоменклатура;
		ПолеХарактеристика	= СтрокаТЗ.ПолеХарактеристика;
		ИмяОбъекта			= СтрокаТЗ.ИмяОбъекта;

		Если СтрокаТЗ.ЭтоРегистр Тогда

			ТекстЗапроса = "ВЫБРАТЬ";

			НаборЗаписей = РегистрыСведений[ИмяОбъекта].СоздатьНаборЗаписей();

			МетаданныеРегистра = НаборЗаписей.Метаданные();

			Для Каждого МетаданныеИзмерения Из МетаданныеРегистра.Измерения Цикл
				СтрокаЗапроса = Символы.ПС + Символы.Таб + МетаданныеИзмерения.Имя + ",";
				ТекстЗапроса  = ТекстЗапроса + СтрокаЗапроса;
			КонецЦикла;

			СтроковыеФункцииКлиентСервер.УдалитьПоследнийСимволВСтроке(ТекстЗапроса, 1);

			СтрокаЗапроса = Символы.ПС + "ИЗ" + Символы.ПС;
			ТекстЗапроса  = ТекстЗапроса + СтрокаЗапроса;

			СтрокаЗапроса = Символы.Таб + СтрокаТЗ.ТипОбъекта + Символы.ПС;
			ТекстЗапроса  = ТекстЗапроса + СтрокаЗапроса;

			СтрокаЗапроса = "ГДЕ " + ПолеНоменклатура + " = &Номенклатура" + Символы.ПС;
			ТекстЗапроса  = ТекстЗапроса + СтрокаЗапроса;

			СтрокаЗапроса = "  И " + ПолеХарактеристика + " = &Характеристика" + Символы.ПС;
			ТекстЗапроса  = ТекстЗапроса + СтрокаЗапроса;

			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Номенклатура",	СтараяНоменклатура);
			Запрос.УстановитьПараметр("Характеристика",	ИскомаяХарактеристика);

			Попытка

				РезультатЗапроса = Запрос.Выполнить();

				ВыборкаРезультата = РезультатЗапроса.Выбрать();

				Пока ВыборкаРезультата.Следующий() Цикл

					МенеджерЗаписи = РегистрыСведений[ИмяОбъекта].СоздатьМенеджерЗаписи();
					ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ВыборкаРезультата);
					МенеджерЗаписи.Прочитать();

					Если МенеджерЗаписи.Выбран() Тогда
						МенеджерЗаписи[ПолеНоменклатура] = НоменклатураЗамены;
						МенеджерЗаписи.Записать();
					КонецЕсли;

				КонецЦикла;

			Исключение
				ТекстСообщения = "Не удалось выполнить замену в регистре: " + ИмяОбъекта + " причина: " + ОписаниеОшибки();
				РазработкаВебСервер.ВывестиСообщениеСервераНаВебКлиент(ТекстСообщения, УникИдФормы);
				Продолжить;
			КонецПопытки;

		ИначеЕсли СтрокаТЗ.ЭтоТЧ Тогда

			БылаЗамена = Ложь;

			ОбъектСсылки = СтрокаТЗ.Ссылка.ПолучитьОбъект();
			ОбъектТЧ = ОбъектСсылки[ИмяОбъекта];

			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить(ПолеНоменклатура,	 СтараяНоменклатура);
			СтруктураПоиска.Вставить(ПолеХарактеристика, ИскомаяХарактеристика);

			НайденныеСтроки = ОбъектТЧ.НайтиСтроки(СтруктураПоиска);

			Для Каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				НайденнаяСтрока[ПолеНоменклатура] = НоменклатураЗамены;
				БылаЗамена = Истина;
			КонецЦикла;

			Если БылаЗамена Тогда
				ПерезаписатьОбъектПриЗаменеНоменклатуры(СтрокаТЗ.Ссылка, ОбъектСсылки, УникИдФормы, НоменклатураЗамены);
			КонецЕсли;

		ИначеЕсли СтрокаТЗ.ПодчинениеРегистратору Тогда

			ОбъектСсылки = СтрокаТЗ.Ссылка.ПолучитьОбъект();
			ПерезаписатьОбъектПриЗаменеНоменклатуры(СтрокаТЗ.Ссылка, ОбъектСсылки, УникИдФормы, НоменклатураЗамены);

		Иначе

			ОбъектСсылки = СтрокаТЗ.Ссылка.ПолучитьОбъект();

			Если ОбъектСсылки[ПолеХарактеристика] = ИскомаяХарактеристика Тогда
				ОбъектСсылки[ПолеНоменклатура] = НоменклатураЗамены;
			КонецЕсли;

			ПерезаписатьОбъектПриЗаменеНоменклатуры(СтрокаТЗ.Ссылка, ОбъектСсылки, УникИдФормы, НоменклатураЗамены);

		КонецЕсли;

	КонецЦикла;

	ОбъектХарактеристики = ИскомаяХарактеристика.ПолучитьОбъект();

	Если ОбъектХарактеристики.Владелец <> НоменклатураЗамены Тогда
		ОбъектХарактеристики.Владелец = НоменклатураЗамены;
		ОбъектХарактеристики.Записать();
	КонецЕсли;

//	ЗафиксироватьТранзакцию();
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

Процедура ПерезаписатьОбъектПриЗаменеНоменклатуры(Ссылка, ОбъектСсылки, УникИдФормы = Неопределено, НоменклатураЗамены = Неопределено)

//	УстановитьПривилегированныйРежим(Истина);

	ТипСсылки = ТипЗнч(Ссылка);

	ЭтоДокумент = Документы.ТипВсеСсылки().СодержитТип(ТипСсылки);

	Если ЗначениеЗаполнено(УникИдФормы) Тогда
		ОбъектСсылки.ДополнительныеСвойства.Вставить("УникИдФормы", УникИдФормы);
	КонецЕсли;

	ОбъектСсылки.ДополнительныеСвойства.Вставить("ЗаменаНоменклатуры", Истина);

	Если ЭтоДокумент
	   И ТипСсылки = Тип("ДокументСсылка.ЧекККМ")
	Тогда
		ОбъектСсылки.ДополнительныеСвойства.Вставить("НеКонтролировать", Истина);
	КонецЕсли;

	Если ЭтоДокумент
	   И ТипСсылки = Тип("ДокументСсылка.зетаБУКомплектация")
	   И ЗначениеЗаполнено(ОбъектСсылки.Автомобиль)
	   И ЗначениеЗаполнено(НоменклатураЗамены)
	   И НЕ РазработкаСервер.ПроверитьЕстьЛиМодельВПрименяемости(
	   		НоменклатураЗамены.ГруппаКроссов
	   		, ОбъектСсылки.Автомобиль.Модель)
	Тогда

		РазрешеноСозданиеПостояннойНоменклатуры = РазработкаСервер.ПолучитьБулевоеЗначениеПраваДляТекущегоПользователя(ПланыВидовХарактеристик.ПраваПользователей.РазрешитьСозданиеПостояннойНоменклатуры);

		РазработкаСервер.СоздатьЗаписьПрименяемостьМодели(
			НоменклатураЗамены.ГруппаКроссов
			, ОбъектСсылки.Автомобиль.Модель
			, НЕ РазрешеноСозданиеПостояннойНоменклатуры
		);

	КонецЕсли;

	Попытка
		Если ЭтоДокумент И ОбъектСсылки.Проведен Тогда
			ОбъектСсылки.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОбъектСсылки.Записать();
		КонецЕсли;
	Исключение
		ТекстСообщения = "Не удалось выполнить замену в объекте: " + Ссылка + " причина: " + ОписаниеОшибки();
		РазработкаВебСервер.ВывестиСообщениеСервераНаВебКлиент(ТекстСообщения, УникИдФормы);
	КонецПопытки;

//	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры
// - 51319 ДДГ 25 мая 2022
#КонецОбласти

// + PN3-141 ДДГ 18 июль 2024
Функция ОплатаКъюАрКодом(Заказ, Контакт, ОтправкаСМС, ПродажаСЗала = Ложь) Экспорт
	Возврат ИнтеграцияСБП.ОплатаКъюАрКодом(Заказ, Контакт, ОтправкаСМС, "ИнтеграцияСбер", ПродажаСЗала);
КонецФункции

Функция Сбер_ПроверитьСтатусЭлектронногоСчета(эСсылка) Экспорт
	Возврат ИнтеграцияСБП.Сбер_ПроверитьСтатусЭлектронногоСчета(эСсылка);
КонецФункции
// - PN3-141 ДДГ 18 июль 2024

// + S1-107 ДДГ 13 авг 2024
Функция Сбер_ПроверитьОплатуПоКъюАрКоду(эСсылка) Экспорт
	Возврат ИнтеграцияСБП.Сбер_ПроверитьОплатуПоКъюАрКоду(эСсылка);
КонецФункции
// - S1-107 ДДГ 13 авг 2024

// + S1-337 ДДГ  9 янв 2025
Функция Сбер_ВыполнитьОтменуЗаказаВозврат(
	  Знач Организация
	, ТипОперации = Неопределено
	, ДанныеОперации
	, ТелефонКлиента = Неопределено
	, НазначениеПлатежа = Неопределено
) Экспорт
	Возврат ИнтеграцияСБП.Сбер_ВыполнитьОтменуЗаказаВозврат(
		  Организация
		, ТипОперации
		, ДанныеОперации
		, ТелефонКлиента
		, НазначениеПлатежа
	);
КонецФункции
// - S1-337 ДДГ  9 янв 2025

// + S1-80 ДДГ  1 авг 2024
Процедура УдалитьОбъект(Объект) Экспорт
	Объект.Удалить();
КонецПроцедуры
// - S1-80 ДДГ  1 авг 2024

Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт
	ЗначениеКонстанты = Константы[ИмяКонстанты].Получить();
	Возврат ЗначениеКонстанты;
КонецФункции
